In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [2]:
df_imdb_name_basics = pd.read_csv('imdb.name.basics.csv.gz')
df_imdb_title = pd.read_csv('imdb.title.akas.csv.gz')
df_imdb_basics = pd.read_csv('imdb.title.basics.csv.gz')
df_imdb_title_crew = pd.read_csv('imdb.title.crew.csv.gz')
df_imdb_title_principals = pd.read_csv('imdb.title.principals.csv.gz')
df_imdb_title_ratings = pd.read_csv('imdb.title.ratings.csv.gz')
df_bmg = pd.read_csv('bom.movie_gross.csv.gz')

In [3]:
# df_imdb_name_basics.head()
df_imdb_title.head()
# df_imdb_basics.head()
# df_imdb_title_crew.head()
# df_imdb_title_principals.head()
# df_imdb_title_ratings.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [4]:
df_imdb_title = df_imdb_title.query("region == 'US'")
df_imdb_title = df_imdb_title[['title_id','title']]
df_imdb_title.drop_duplicates(subset=['title_id'],inplace = True)
df_imdb_title

          title_id                                       title
12       tt0369610                           Jurassic World 3D
50       tt0401729                         John Carter of Mars
109      tt1014759  Alice in Wonderland: An IMAX 3D Experience
152     tt10379338                              Guys Night Out
157     tt10446418                                    The Icon
...            ...                                         ...
331641   tt9310460   Coconut The Little Dragon Into The Jungle
331654   tt9358044                                 Hail Satan?
331673   tt9562694                               Alien Warfare
331686   tt9705860         Dusan Vukotic Croatian Oscar Winner
331694   tt9755806                                   Big Shark

[47433 rows x 2 columns]

In [5]:
df_imdb_name_basics = df_imdb_name_basics[df_imdb_name_basics['known_for_titles'].notna()]
df_imdb_name_basics = df_imdb_name_basics[['nconst','primary_name', 'primary_profession', 'known_for_titles']]
df_imdb_name_basics['known_for_titles'] = df_imdb_name_basics['known_for_titles'].str.split(",")
#Names of 
#nconst

In [6]:
mask = df_imdb_name_basics['primary_profession'].str.contains('director|writer', na=True)

directors_writers_df = df_imdb_name_basics[mask]

In [7]:
df_imdb_title

          title_id                                       title
12       tt0369610                           Jurassic World 3D
50       tt0401729                         John Carter of Mars
109      tt1014759  Alice in Wonderland: An IMAX 3D Experience
152     tt10379338                              Guys Night Out
157     tt10446418                                    The Icon
...            ...                                         ...
331641   tt9310460   Coconut The Little Dragon Into The Jungle
331654   tt9358044                                 Hail Satan?
331673   tt9562694                               Alien Warfare
331686   tt9705860         Dusan Vukotic Croatian Oscar Winner
331694   tt9755806                                   Big Shark

[47433 rows x 2 columns]

In [8]:
df_imdb_basics.query("start_year == start_year.min()")
df_imdb_title = df_imdb_title.merge(df_imdb_basics, how="inner", left_on="title_id", right_on="tconst")
#Oldest movies start in 2010

In [9]:
df_imdb_title.columns

df_imdb_title = df_imdb_title[['title_id', 'title', 'start_year', 'runtime_minutes']]

In [10]:
df_imdb_title

,title_id,title,start_year,runtime_minutes
0,tt0369610,Jurassic World 3D,2015,124.0
1,tt0401729,John Carter of Mars,2012,132.0
2,tt1014759,Alice in Wonderland: An IMAX 3D Experience,2010,108.0
3,tt10379338,Guys Night Out,2019,NaN
4,tt10446418,The Icon,2011,215.0
...,...,...,...,...
47428,tt9310460,Coconut The Little Dragon Into The Jungle,2018,NaN
47429,tt9358044,Hail Satan?,2019,95.0
47430,tt9562694,Alien Warfare,2019,88.0
47431,tt9705860,Dusan Vukotic Croatian Oscar Winner,2011,55.0
47432,tt9755806,Big Shark,2019,NaN

In [11]:
title_crew_df= df_imdb_title.merge(df_imdb_title_crew, how="inner", left_on="title_id", right_on="tconst")
title_crew_df

,title_id,title,start_year,runtime_minutes,tconst,directors,writers
0,tt0369610,Jurassic World 3D,2015,124.0,tt0369610,nm1119880,"nm0415425,nm0798646,nm1119880,nm2081046,nm0000341"
1,tt0401729,John Carter of Mars,2012,132.0,tt0401729,nm0004056,"nm0004056,nm0028764,nm0149290,nm0123194"
2,tt1014759,Alice in Wonderland: An IMAX 3D Experience,2010,108.0,tt1014759,nm0000318,"nm0941314,nm0140902"
3,tt10379338,Guys Night Out,2019,NaN,tt10379338,nm2584377,nm10715703
4,tt10446418,The Icon,2011,215.0,tt10446418,nm4270970,NaN
...,...,...,...,...,...,...,...
47428,tt9310460,Coconut The Little Dragon Into The Jungle,2018,NaN,tt9310460,nm2106115,"nm2173401,nm0910419"
47429,tt9358044,Hail Satan?,2019,95.0,tt9358044,nm3704075,NaN
47430,tt9562694,Alien Warfare,2019,88.0,tt9562694,nm1371053,"nm6188062,nm10597982,nm5703427"
47431,tt9705860,Dusan Vukotic Croatian Oscar Winner,2011,55.0,tt9705860,nm1248890,"nm1082058,nm1248890"
47432,tt9755806,Big Shark,2019,NaN,tt9755806,nm1382072,"nm2427684,nm0802995,nm1382072"

In [12]:
df_imdb_title_ratings

movie_title_crew_rating_df = title_crew_df.merge(df_imdb_title_ratings, how="inner", left_on="title_id", right_on="tconst")
movie_title_crew_rating_df

,title_id,title,start_year,runtime_minutes,tconst_x,directors,writers,tconst_y,averagerating,numvotes
0,tt0369610,Jurassic World 3D,2015,124.0,tt0369610,nm1119880,"nm0415425,nm0798646,nm1119880,nm2081046,nm0000341",tt0369610,7.0,539338
1,tt0401729,John Carter of Mars,2012,132.0,tt0401729,nm0004056,"nm0004056,nm0028764,nm0149290,nm0123194",tt0401729,6.6,241792
2,tt1014759,Alice in Wonderland: An IMAX 3D Experience,2010,108.0,tt1014759,nm0000318,"nm0941314,nm0140902",tt1014759,6.5,358813
3,tt1182315,Dark Buenos Aires,2010,90.0,tt1182315,nm1413776,"nm0267066,nm1413776",tt1182315,3.4,123
4,tt1194173,Marcher,2012,135.0,tt1194173,nm0006904,"nm0006904,nm0319659,nm0524924",tt1194173,6.7,268678
...,...,...,...,...,...,...,...,...,...,...
26649,tt7315648,OJ: Guilty in Vegas,2017,100.0,tt7315648,NaN,NaN,tt7315648,6.0,27
26650,tt9080630,Girl/Girl Scene,2019,122.0,tt9080630,nm2717314,nm2717314,tt9080630,2.1,112
26651,tt9310460,Coconut The Little Dragon Into The Jungle,2018,NaN,tt9310460,nm2106115,"nm2173401,nm0910419",tt9310460,5.9,43
26652,tt9358044,Hail Satan?,2019,95.0,tt9358044,nm3704075,NaN,tt9358044,6.8,628
26653,tt9562694,Alien Warfare,2019,88.0,tt9562694,nm1371053,"nm6188062,nm10597982,nm5703427",tt9562694,2.6,1509

In [13]:
movie_title_crew_rating_df = movie_title_crew_rating_df.loc[:,['title_id','title', 'directors', 'writers','averagerating','numvotes','start_year','runtime_minutes']]
movie_title_crew_rating_df.dropna(subset=['title','directors'], inplace=True)
movie_title_crew_rating_df

,title_id,title,directors,writers,averagerating,numvotes,start_year,runtime_minutes
0,tt0369610,Jurassic World 3D,nm1119880,"nm0415425,nm0798646,nm1119880,nm2081046,nm0000341",7.0,539338,2015,124.0
1,tt0401729,John Carter of Mars,nm0004056,"nm0004056,nm0028764,nm0149290,nm0123194",6.6,241792,2012,132.0
2,tt1014759,Alice in Wonderland: An IMAX 3D Experience,nm0000318,"nm0941314,nm0140902",6.5,358813,2010,108.0
3,tt1182315,Dark Buenos Aires,nm1413776,"nm0267066,nm1413776",3.4,123,2010,90.0
4,tt1194173,Marcher,nm0006904,"nm0006904,nm0319659,nm0524924",6.7,268678,2012,135.0
...,...,...,...,...,...,...,...,...
26648,tt7315526,Devil's Tree: Rooted Evil,"nm2845202,nm2608588","nm2608588,nm2845202",4.9,1466,2018,76.0
26650,tt9080630,Girl/Girl Scene,nm2717314,nm2717314,2.1,112,2019,122.0
26651,tt9310460,Coconut The Little Dragon Into The Jungle,nm2106115,"nm2173401,nm0910419",5.9,43,2018,NaN
26652,tt9358044,Hail Satan?,nm3704075,NaN,6.8,628,2019,95.0
26653,tt9562694,Alien Warfare,nm1371053,"nm6188062,nm10597982,nm5703427",2.6,1509,2019,88.0

In [14]:
movie_title_crew_rating_df['writers'] = movie_title_crew_rating_df.loc[:,'writers'].str.split(",")
movie_title_crew_rating_df['directors'] = movie_title_crew_rating_df.loc[:,'directors'].str.split(",")

In [15]:
movie_title_crew_rating_df.dropna(subset=['directors', 'writers'], inplace=True)

In [16]:
type(movie_title_crew_rating_df['writers'].iloc[0])

list

In [17]:
type(movie_title_crew_rating_df['directors'].iloc[0])

list

In [18]:
movie_title_crew_rating_df.dropna(inplace=True)
movie_title_crew_rating_df.reset_index(inplace = True)

In [19]:
movie_title_crew_rating_df

,index,title_id,title,directors,writers,averagerating,numvotes,start_year,runtime_minutes
0,0,tt0369610,Jurassic World 3D,[nm1119880],"[nm0415425, nm0798646, nm1119880, nm2081046, n...",7.0,539338,2015,124.0
1,1,tt0401729,John Carter of Mars,[nm0004056],"[nm0004056, nm0028764, nm0149290, nm0123194]",6.6,241792,2012,132.0
2,2,tt1014759,Alice in Wonderland: An IMAX 3D Experience,[nm0000318],"[nm0941314, nm0140902]",6.5,358813,2010,108.0
3,3,tt1182315,Dark Buenos Aires,[nm1413776],"[nm0267066, nm1413776]",3.4,123,2010,90.0
4,4,tt1194173,Marcher,[nm0006904],"[nm0006904, nm0319659, nm0524924]",6.7,268678,2012,135.0
...,...,...,...,...,...,...,...,...,...
21506,26645,tt7275980,Mushino,[nm9215844],"[nm9215844, nm9215845]",5.1,28,2017,80.0
21507,26646,tt7293920,The Fare,[nm2952421],[nm6446224],6.8,20,2018,82.0
21508,26648,tt7315526,Devil's Tree: Rooted Evil,"[nm2845202, nm2608588]","[nm2608588, nm2845202]",4.9,1466,2018,76.0
21509,26650,tt9080630,Girl/Girl Scene,[nm2717314],[nm2717314],2.1,112,2019,122.0
21510,26653,tt9562694,Alien Warfare,[nm1371053],"[nm6188062, nm10597982, nm5703427]",2.6,1509,2019,88.0

In [20]:
df_bmg.dropna(inplace=True)
df_bmg['foreign_gross'] = df_bmg['foreign_gross'].str.replace(',', '')
df_bmg['foreign_gross'] = df_bmg['foreign_gross'].astype(float)

#Converted dollar basis to million
df_bmg['foreign_gross'] = df_bmg['foreign_gross'] / 1000000
df_bmg['domestic_gross'] = df_bmg['domestic_gross'] / 1000000

df_bmg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2007 entries, 0 to 3353
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2007 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2007 non-null   float64
 3   foreign_gross   2007 non-null   float64
 4   year            2007 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 94.1+ KB

In [21]:
movie_title_crew_rating_df

,index,title_id,title,directors,writers,averagerating,numvotes,start_year,runtime_minutes
0,0,tt0369610,Jurassic World 3D,[nm1119880],"[nm0415425, nm0798646, nm1119880, nm2081046, n...",7.0,539338,2015,124.0
1,1,tt0401729,John Carter of Mars,[nm0004056],"[nm0004056, nm0028764, nm0149290, nm0123194]",6.6,241792,2012,132.0
2,2,tt1014759,Alice in Wonderland: An IMAX 3D Experience,[nm0000318],"[nm0941314, nm0140902]",6.5,358813,2010,108.0
3,3,tt1182315,Dark Buenos Aires,[nm1413776],"[nm0267066, nm1413776]",3.4,123,2010,90.0
4,4,tt1194173,Marcher,[nm0006904],"[nm0006904, nm0319659, nm0524924]",6.7,268678,2012,135.0
...,...,...,...,...,...,...,...,...,...
21506,26645,tt7275980,Mushino,[nm9215844],"[nm9215844, nm9215845]",5.1,28,2017,80.0
21507,26646,tt7293920,The Fare,[nm2952421],[nm6446224],6.8,20,2018,82.0
21508,26648,tt7315526,Devil's Tree: Rooted Evil,"[nm2845202, nm2608588]","[nm2608588, nm2845202]",4.9,1466,2018,76.0
21509,26650,tt9080630,Girl/Girl Scene,[nm2717314],[nm2717314],2.1,112,2019,122.0
21510,26653,tt9562694,Alien Warfare,[nm1371053],"[nm6188062, nm10597982, nm5703427]",2.6,1509,2019,88.0

In [22]:
df_bmg = df_bmg.loc[:,['title','domestic_gross','foreign_gross','year']]
movie_title_crew_rating_df = movie_title_crew_rating_df.merge(df_bmg, left_on=['title','start_year'], right_on=['title','year'])
movie_title_crew_rating_df = movie_title_crew_rating_df.dropna()
movie_title_crew_rating_df = movie_title_crew_rating_df.drop(['index'], axis=1)

In [39]:
movie_title_crew_rating_df.sort_values('foreign_gross', ascending=False)

,title_id,title,directors,writers,averagerating,numvotes,start_year,runtime_minutes,domestic_gross,foreign_gross,year
583,tt4881806,Jurassic World: Fallen Kingdom,[nm1291105],"[nm2081046, nm1119880, nm0000341]",6.2,219125,2018,128.0,417.700,891.800000,2018
88,tt2294629,Frozen,"[nm0118333, nm1601644]","[nm1601644, nm0026153, nm0118333, nm2280850]",7.5,516998,2013,102.0,400.700,875.700000,2013
81,tt2293640,Minions,"[nm1853544, nm0049633]",[nm0528244],6.4,193917,2015,91.0,336.000,823.400000,2015
524,tt1298650,Pirates of the Caribbean: On Stranger Tides,[nm0551128],"[nm0254645, nm0744429, nm0064181, nm0938684, n...",6.6,447624,2011,136.0,241.100,804.600000,2011
256,tt1074638,Skyfall,[nm0005222],"[nm0701031, nm0905498, nm0517589, nm0001220]",7.8,592221,2012,143.0,304.400,804.200000,2012
...,...,...,...,...,...,...,...,...,...,...,...
322,tt1403988,The Romantics,[nm0630633],[nm0630633],5.1,11069,2010,95.0,0.107,0.017300,2010
148,tt1152822,Freakonomics,"[nm1823216, nm0316795, nm1164861, nm1823227, n...","[nm0119989, nm0316795, nm2505733, nm1041597, n...",6.4,6466,2010,93.0,0.101,0.016400,2010
731,tt4154756,Avengers: Infinity War,"[nm0751577, nm0751648]","[nm1321655, nm1321656, nm0498278, nm0456158, n...",8.5,670926,2018,149.0,678.800,0.001370,2018
483,tt2820852,Furious 7,[nm1490123],"[nm0604555, nm0860155]",7.2,335074,2015,137.0,353.000,0.001163,2015
402,tt2488496,Star Wars: The Force Awakens,[nm0009190],"[nm0001410, nm0009190, nm1578335, nm0000184]",8.0,784780,2015,136.0,936.700,0.001132,2015

In [34]:
res = pd.DataFrame(movie_title_crew_rating_df.groupby(movie_title_crew_rating_df['directors'].map(tuple))['foreign_gross'].mean())

In [37]:
res.sort_values('foreign_gross', ascending=False)

                                                    foreign_gross
directors
(nm0118333, nm1601644)                                 875.700000
(nm1853544, nm0049633)                                 823.400000
(nm0005222,)                                           804.200000
(nm0049633, nm3210494, nm1853544)                      770.200000
(nm0001392,)                                           706.333333
...                                                           ...
(nm1068198,)                                             0.018600
(nm0630633,)                                             0.017300
(nm1823216, nm0316795, nm1164861, nm1823227, nm...       0.016400
(nm0751577, nm0751648)                                   0.001370
(nm0009190,)                                             0.001132

[574 rows x 1 columns]